nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_rf.h
/*
 *
 * Copyright (c) 2026 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @file
 * @addtogroup nrf71_wifi_fw_if Wi-Fi driver and firmware interface
 * @{
 * @brief Control interface between host and RPU
 */

#ifndef __NRF71_WIFI_RF_H
#define __NRF71_WIFI_RF_H

#define NRF_WIFI_RF_PARAMS_SIZE	200

#define NUM_WIFI_PARAMS 22

#define NRF_WIFI_PARAMS1 "1A04180100"

#define NRF_WIFI_PARAMS2 "FB0000"

#define NRF_WIFI_PARAMS3 "181111110C0B0A0F0E0D11100F0A0A0A0A0A0A0C0C0C0C0C0C0E0E0E0E0E0E00"

#define NRF_WIFI_PARAMS4 "0000000000000000000000000000000000000000000000000000000000000000000000"

#define NRF_WIFI_PARAMS5 "CCAB785644000000000000000000000000000000000000000000000000000000000000"

#define NRF_WIFI_PARAMS6 "D8F6374B7D5A460AF3000000360000001B00000000000000000000000F3C002800"

#define NRF_WIFI_PARAMS7 "FB8300FBFBFBBB40760000000A6464000110000100080002000240000800020002401000080002000240040A14E0010100"

#define NRF_WIFI_PARAMS8 "C000500000000128002800C050500C011122333733C60A0620203F3F3C3C20203F3F3C3C03901E200300000000008000800000"

#define NRF_WIFI_PARAMS9 "1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F1F00"

#define NRF_WIFI_PARAMS10 "0000000000"

#define NRF_WIFI_PARAMS11 "38014E2A000000003C046503"

#define NRF_WIFI_PARAMS12 "000000000000000000"

#define NRF_WIFI_PARAMS13 "00"

#define NRF_WIFI_PARAMS14 "F0FFA03A0B00250000703C00FFC0E101947FE0000F4A80000846E30FFF420403820262010C000000C02D1000625C2200"

#define NRF_WIFI_PARAMS15 "695302000000000069530200000000006953020034120000"

#define NRF_WIFI_PARAMS16 "18000000F5E52101ECECEC00796EDB007681450191B104009F9F0000AF43000089221400AEC20300550000000619200086010000FF6F8212010100009F9F9F00"

#define NRF_WIFI_PARAMS17 "3E482600004AF4E2874603010D8506008D460300A0A4900018030000B2110000F40D0000190613000933020053A24F00C66A0000EFF64A0028A00F00E801000040014200A3A9AF00BBC7010098C40000F400020040B48D004924910092B69100DB48920024499200582F150070FE0300E0D1070063306000"

#define NRF_WIFI_PARAMS18 "00000000"

#define NRF_WIFI_PARAMS19 "00000000"

#define NRF_WIFI_PARAMS20 "00000000"

#define NRF_WIFI_PARAMS21 "00000000"

#define NRF_WIFI_PARAMS22 "00000000"

#define NRF_WIFI_RF_PARAMS_OFF_RESV_1 0
#define NRF_WIFI_RF_PARAMS_OFF_CALIB_X0 6
#define NRF_WIFI_RF_PARAMS_OFF_CALIB_PDADJM7 7
#define NRF_WIFI_RF_PARAMS_OFF_CALIB_PDADJM0 11
#define NRF_WIFI_RF_PARAMS_OFF_CALIB_PWR2G 15
#define NRF_WIFI_RF_PARAMS_OFF_CALIB_PWR2GM0M7 16
#define NRF_WIFI_RF_PARAMS_OFF_CALIB_PWR5GM7 18
#define NRF_WIFI_RF_PARAMS_OFF_CALIB_PWR5GM0 21
#define NRF_WIFI_RF_PARAMS_OFF_CALIB_RXGNOFF 24
#define NRF_WIFI_RF_PARAMS_OFF_CALIB_MAX_TEMP 28
#define NRF_WIFI_RF_PARAMS_OFF_CALIB_MIN_TEMP 29
#define NRF_WIFI_RF_PARAMS_OFF_CALIB_TXP_BOFF_2GH 30
#define NRF_WIFI_RF_PARAMS_OFF_CALIB_TXP_BOFF_2GL 31
#define NRF_WIFI_RF_PARAMS_OFF_CALIB_TXP_BOFF_5GH 32
#define NRF_WIFI_RF_PARAMS_OFF_CALIB_TXP_BOFF_5GL 33
#define NRF_WIFI_RF_PARAMS_OFF_CALIB_TXP_BOFF_V 34
#define NRF_WIFI_RF_PARAMS_OFF_CALIB_RESV_2 37

#define NRF_WIFI_PHY_CALIB_FLAG_RXDC 1
#define NRF_WIFI_PHY_CALIB_FLAG_TXDC 2
#define NRF_WIFI_PHY_CALIB_FLAG_TXPOW 0
#define NRF_WIFI_PHY_CALIB_FLAG_TXIQ 8   /* 8 */
#define NRF_WIFI_PHY_CALIB_FLAG_RXIQ 16  /* 16 */
#define NRF_WIFI_PHY_CALIB_FLAG_DPD  32
#define NRF_WIFI_PHY_CALIB_FLAG_ENHANCED_TXDC 64

#define NRF_WIFI_PHY_SCAN_CALIB_FLAG_RXDC (1<<16)
#define NRF_WIFI_PHY_SCAN_CALIB_FLAG_TXDC (2<<16)
#define NRF_WIFI_PHY_SCAN_CALIB_FLAG_TXPOW (0<<16)
#define NRF_WIFI_PHY_SCAN_CALIB_FLAG_TXIQ (0<<16)
#define NRF_WIFI_PHY_SCAN_CALIB_FLAG_RXIQ (0<<16)
#define NRF_WIFI_PHY_SCAN_CALIB_FLAG_DPD (0<<16)
#define NRF_WIFI_LP_PHY_CALIB_FLAG_RXDC (1<<24)

#define NRF_WIFI_DEF_PHY_CALIB (NRF_WIFI_PHY_CALIB_FLAG_RXDC |\
		 NRF_WIFI_PHY_CALIB_FLAG_TXDC |\
		 NRF_WIFI_PHY_CALIB_FLAG_RXIQ |\
		 NRF_WIFI_PHY_CALIB_FLAG_TXIQ |\
		 NRF_WIFI_PHY_CALIB_FLAG_TXPOW |\
		 NRF_WIFI_PHY_CALIB_FLAG_DPD |\
		 NRF_WIFI_PHY_CALIB_FLAG_ENHANCED_TXDC |\
		 NRF_WIFI_PHY_SCAN_CALIB_FLAG_RXDC |\
		 NRF_WIFI_PHY_SCAN_CALIB_FLAG_TXDC |\
		 NRF_WIFI_PHY_SCAN_CALIB_FLAG_RXIQ |\
		 NRF_WIFI_PHY_SCAN_CALIB_FLAG_TXIQ |\
		 NRF_WIFI_PHY_SCAN_CALIB_FLAG_TXPOW |\
		 NRF_WIFI_PHY_SCAN_CALIB_FLAG_DPD |\
		 NRF_WIFI_LP_PHY_CALIB_FLAG_RXDC)

/* Temperature based calibration params */
#define NRF_WIFI_DEF_PHY_TEMP_CALIB (NRF_WIFI_PHY_CALIB_FLAG_RXDC |\
				 NRF_WIFI_PHY_CALIB_FLAG_TXDC |\
				 NRF_WIFI_PHY_CALIB_FLAG_ENHANCED_TXDC |\
				 NRF_WIFI_PHY_CALIB_FLAG_RXIQ |\
				 NRF_WIFI_PHY_CALIB_FLAG_TXIQ |\
				 NRF_WIFI_PHY_CALIB_FLAG_TXPOW |\
				 NRF_WIFI_PHY_CALIB_FLAG_DPD)

#define NRF_WIFI_TEMP_CALIB_PERIOD (1024 * 1024) /* micro seconds */
#define NRF_WIFI_TEMP_CALIB_THRESHOLD (40)
#define NRF_WIFI_TEMP_CALIB_ENABLE 0

/* Battery voltage changes base calibrations and voltage thresholds */
#define NRF_WIFI_DEF_PHY_VBAT_CALIB (NRF_WIFI_PHY_CALIB_FLAG_DPD)
#define NRF_WIFI_VBAT_VERYLOW (3) /* Corresponds to (2.5+3*0.07)=2.71V */
#define NRF_WIFI_VBAT_LOW  (6)  /* Correspond to (2.5+6*0.07)=2.92V */
#define NRF_WIFI_VBAT_HIGH (12) /* Correspond to (2.5+12*0.07)=3.34V */

#define VBAT_OFFSET_MILLIVOLT (2500)
#define VBAT_SCALING_FACTOR (70)

enum ANT_GAIN_OFFSETS {
	ANT_GAIN_2G_OFST = 181,
	ANT_GAIN_5G_BAND1_OFST,
	ANT_GAIN_5G_BAND2_OFST,
	ANT_GAIN_5G_BAND3_OFST,
	NUM_ANT_GAIN = 4
};

/**
 * @}
 */
#endif /* __NRF71_WIFI_RF_H */
